&НаСервере
Функция обМакетВТаблицуЗначений(Макет) Экспорт
    ТЗ = Новый ТаблицаЗначений();
//#Если Клиент Тогда
    //Считываем колонки
	Для Стр=1 По Макет.ВысотаТаблицы Цикл
		Если Стр>1 Тогда
        	ТекСтр=ТЗ.Добавить();
		КонецЕсли;
		ПустаяСтрока=истина;
		Для Кол=1 По Макет.ШиринаТаблицы Цикл
			Яч=Макет.Область(Стр, Кол);
			Если Яч.СодержитЗначение Тогда
				Зн=Яч.Значение;
			Иначе
				Зн=Яч.Текст;
			КонецЕсли;
			Если ТипЗнч(Зн)=Тип("Строка") И ПустаяСтрока(Зн) Тогда
				Зн=Неопределено;
			КонецЕсли;
			
			//Добавляем колонку
			Если Стр=1 Тогда
		        ТЗ.Колонки.Добавить(Зн);
			Иначе
				ТекСтр[Кол-1]=Зн;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
//#КонецЕсли
   Возврат ТЗ;
КонецФункции 

&НаСервере
Функция ПолучитьОшибкиДанныеСОП()Экспорт 
	Ответ = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеСОП.Ссылка КАК Ссылка,
		|	ДанныеСОП.ПассажирыВзрослые КАК ПассажирыВзрослые,
		|	ДанныеСОП.ПассажирыДети КАК ПассажирыДети,
		|	ДанныеСОП.ПассажирыМалыши КАК ПассажирыМалыши,
		|	ДанныеСОП.РучнаяКладь КАК РучнаяКладь,
		|	ДанныеСОП.Багаж КАК Багаж,
		|	ДанныеСОП.Почта КАК Почта,
		|	ДанныеСОП.Груз КАК Груз,
		|	ДанныеСОП.Документ.ПассажирыВзрослые КАК ДокументПассажирыВзрослые,
		|	ДанныеСОП.Документ.ПассажирыДети КАК ДокументПассажирыДети,
		|	ДанныеСОП.Документ.ПассажирыМалыши КАК ДокументПассажирыМалыши,
		|	ДанныеСОП.Документ.РучнаяКладь КАК ДокументРучнаяКладь,
		|	ДанныеСОП.Документ.Багаж КАК ДокументБагаж,
		|	ДанныеСОП.Документ.Почта КАК ДокументПочта,
		|	ДанныеСОП.Документ.Груз КАК ДокументГруз,
		|	ДанныеСОП.VIPПассажирыВзрослые КАК VIPПассажирыВзрослые,
		|	ДанныеСОП.VIPПассажирыДети КАК VIPПассажирыДети,
		|	ДанныеСОП.Документ.VIPПассажирыВзрослые КАК ДокументVIPПассажирыВзрослые,
		|	ДанныеСОП.Документ.VIPПассажирыДети КАК ДокументVIPПассажирыДети
		|ИЗ
		|	Документ.ДанныеСОП КАК ДанныеСОП
		|ГДЕ
		|	(ДанныеСОП.ПассажирыВзрослые <> ДанныеСОП.Документ.ПассажирыВзрослые
		|			ИЛИ ДанныеСОП.ПассажирыДети <> ДанныеСОП.Документ.ПассажирыДети
		|			ИЛИ ДанныеСОП.ПассажирыМалыши <> ДанныеСОП.Документ.ПассажирыМалыши
		|			ИЛИ ДанныеСОП.РучнаяКладь <> ДанныеСОП.Документ.РучнаяКладь
		|			ИЛИ ДанныеСОП.Багаж <> ДанныеСОП.Документ.Багаж
		|			ИЛИ ДанныеСОП.Почта <> ДанныеСОП.Документ.Почта
		|			ИЛИ ДанныеСОП.Груз <> ДанныеСОП.Документ.Груз
		|			ИЛИ ДанныеСОП.VIPПассажирыВзрослые <> ЕСТЬNULL(ДанныеСОП.Документ.VIPПассажирыВзрослые, 0)
		|			ИЛИ ДанныеСОП.VIPПассажирыДети <> ЕСТЬNULL(ДанныеСОП.Документ.VIPПассажирыДети, 0))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Ответ.Вставить("Результат",Ложь);
	Иначе 
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Результат = Ложь;
		номер = 1;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Разница = "";
			Если ВыборкаДетальныеЗаписи.ПассажирыВзрослые <> ВыборкаДетальныеЗаписи.ДокументПассажирыВзрослые Тогда 
				Разница = Разница + "ПасВзр " + ВыборкаДетальныеЗаписи.ДокументПассажирыВзрослые + "(" + ВыборкаДетальныеЗаписи.ПассажирыВзрослые + ")";
				Результат = Истина;
			КонецЕсли;	
			Если ВыборкаДетальныеЗаписи.ПассажирыДети <> ВыборкаДетальныеЗаписи.ДокументПассажирыДети Тогда 
				Разница = Разница + "ПасДет " + ВыборкаДетальныеЗаписи.ДокументПассажирыДети + "(" + ВыборкаДетальныеЗаписи.ПассажирыДети + ")";
				Результат = Истина;	
			КонецЕсли;	
			Если ВыборкаДетальныеЗаписи.ПассажирыМалыши <> ВыборкаДетальныеЗаписи.ДокументПассажирыМалыши Тогда 
				Разница = Разница + "ПасМал " + ВыборкаДетальныеЗаписи.ДокументПассажирыМалыши + "(" + ВыборкаДетальныеЗаписи.ПассажирыМалыши + ")";
				Результат = Истина;	
			КонецЕсли;	
			Если ВыборкаДетальныеЗаписи.Багаж <> ВыборкаДетальныеЗаписи.ДокументБагаж Тогда 
				Разница = Разница + "Ба " + ВыборкаДетальныеЗаписи.ДокументБагаж + "(" + ВыборкаДетальныеЗаписи.Багаж + ")";
				Результат = Истина;	
			КонецЕсли;	
			Если ВыборкаДетальныеЗаписи.РучнаяКладь <> ВыборкаДетальныеЗаписи.ДокументРучнаяКладь Тогда 
				Разница = Разница + "Рк " + ВыборкаДетальныеЗаписи.ДокументРучнаяКладь + "(" + ВыборкаДетальныеЗаписи.РучнаяКладь + ")";
				Результат = Истина;	
			КонецЕсли;	
			Если ВыборкаДетальныеЗаписи.Почта <> ВыборкаДетальныеЗаписи.ДокументПочта Тогда 
				Разница = Разница + "По " + ВыборкаДетальныеЗаписи.ДокументПочта + "(" + ВыборкаДетальныеЗаписи.Почта + ")";
				Результат = Истина;	
			КонецЕсли;	
			Если ВыборкаДетальныеЗаписи.Груз <> ВыборкаДетальныеЗаписи.ДокументГруз Тогда 
				Разница = Разница + "Гр " + ВыборкаДетальныеЗаписи.ДокументГруз + "(" + ВыборкаДетальныеЗаписи.Груз + ")";
				Результат = Истина;	
			КонецЕсли;	
			Если (ВыборкаДетальныеЗаписи.VIPПассажирыВзрослые <> ?(ВыборкаДетальныеЗаписи.ДокументVIPПассажирыВзрослые=NULL,0,ВыборкаДетальныеЗаписи.ДокументVIPПассажирыВзрослые))
				И (ВыборкаДетальныеЗаписи.ДокументVIPПассажирыВзрослые<>NULL) Тогда 
				Разница = Разница + "ПасВзрV " + ВыборкаДетальныеЗаписи.ДокументVIPПассажирыВзрослые + "(" + ВыборкаДетальныеЗаписи.VIPПассажирыВзрослые + ")";
				Результат = Истина;	
			КонецЕсли;	
			Если (ВыборкаДетальныеЗаписи.VIPПассажирыДети <> ?(ВыборкаДетальныеЗаписи.ДокументVIPПассажирыДети=NULL,0,ВыборкаДетальныеЗаписи.ДокументVIPПассажирыДети))
				И (ВыборкаДетальныеЗаписи.ДокументVIPПассажирыДети<>NULL) Тогда 
				Разница = Разница + "ПасДетV " + ВыборкаДетальныеЗаписи.ДокументVIPПассажирыДети + "(" + ВыборкаДетальныеЗаписи.VIPПассажирыДети + ")";
				Результат = Истина;	
			КонецЕсли;	
			Пара = Новый Структура;
			Пара.Вставить("Ссылка",ВыборкаДетальныеЗаписи.Ссылка);
			Пара.Вставить("Разница",Разница);
			Ответ.Вставить("Пара"+номер,Пара);
			номер = номер + 1;
		КонецЦикла;
		Если Результат Тогда
			Ответ.Вставить("Результат",Истина);
		Иначе 
			Ответ.Вставить("Результат",Ложь);
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат Ответ;
		
КонецФункции

&НаСервере
Функция РольПолныеПраваДиспетчерСОПДиспетчерПДСА() Экспорт 
	Если РольДоступна("ПолныеПрава") или РольДоступна("ДиспетчерПДСА") или РольДоступна("ДиспетчерСОП") Тогда 
		Возврат Истина;	
	Иначе 	
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	

&НаСервере
Функция ОтправитьСообщение(
    пАдресПолучателя, пТемаСообщения, пТекстСообщения, пВложение,
    пАдресОтправителя, пСерверSMTP, пПортSMTP, пПользовательSMTP, пПарольSMTP) Экспорт
    
    //Отправка сообщения
    Попытка
        
        //Создадим профиль подключения
        Профиль = Новый ИнтернетПочтовыйПрофиль;
        Профиль.АдресСервераSMTP   = пСерверSMTP;
        Профиль.ПортSMTP           = пПортSMTP;
        Профиль.ПользовательSMTP   = пПользовательSMTP;
        Профиль.ПарольSMTP         = пПарольSMTP;
        Профиль.ВремяОжидания      = 180; 
        Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
		Профиль.ИспользоватьSSLSMTP = Истина;
        
        //Создадим сообщение для отправки
        Сообщение = Новый ИнтернетПочтовоеСообщение;
        Сообщение.Получатели.Добавить(пАдресПолучателя);
        Сообщение.Отправитель.Адрес = пАдресОтправителя;
        Сообщение.Тема = пТемаСообщения;
        Сообщение.Тексты.Добавить(пТекстСообщения);
		Если ЗначениеЗаполнено(пВложение) Тогда
		    Сообщение.Вложения.Добавить(пВложение);
		КонецЕсли;
        
        //Отправка сообщения
        Почта = Новый ИнтернетПочта;
        Почта.Подключиться(Профиль);
        Почта.Послать(Сообщение);
        Почта.Отключиться();
        
        Возврат Истина;
    
    Исключение
        
        Сообщить(ОписаниеОшибки());        
        Возврат Ложь;
        
    КонецПопытки;
    
КонецФункции