
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вариант <> "Сегодня" И
		КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вариант <> "Завтра" Тогда
	
		//получаем идентификатор настройки
		ИдНастройки =
		КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту
		(КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра
		(Новый ПараметрКомпоновкиДанных("Дата")));
		
		
		//получаем параметр по идентификатору
		ПараметрСКДДата =
		КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдНастройки).Значение.Дата;
		
		//в случае если параметр отчета (дата) отличается от предыдущей настройки - проверяем состояние отправки
		// Если ПараметрСКДДата <> ДатаДокумента Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОтправкаНаПочту.Период КАК Период
			|ИЗ
			|	РегистрСведений.ОтправкаНаПочту КАК ОтправкаНаПочту
			|ГДЕ
			|	ОтправкаНаПочту.ТипОтправляемогоДокумента = &ТипОтправляемогоДокумента
			|	И ОтправкаНаПочту.НомерДокумента = &НомерДокумента";
		
			Запрос.УстановитьПараметр("НомерДокумента", Строка(ДеньГода(ПараметрСКДДата)));
			Запрос.УстановитьПараметр("ТипОтправляемогоДокумента", Перечисления.ТипОтправляемогоДокумента.СуточныйПлан);
			
			Если Запрос.Выполнить().Пустой() Тогда
				Отправлено = "Отчет еще не отправлялся";		
			Иначе 
				Выборка = Запрос.Выполнить().Выбрать();
				Периоды = "";
				Пока Выборка.Следующий()Цикл
					Периоды = Периоды + Выборка.Период + " ";									
				КонецЦикла;
				Отправлено = "Отчет отправлен ранее: " + Периоды;
			КонецЕсли;
			
			ДатаДокумента = ПараметрСКДДата;
			
		// КонецЕсли;
		
	КонецЕсли;
	                         	
	// настройки масштаба и ориентации 
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.АвтоМасштаб = Истина;
	
КонецПроцедуры

