&НаСервере
Функция ПолучитьГраницуЗапретаИзменений()
	Возврат Константы.ГраницаЗапретаИзменений.Получить()	
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Объект.Документ = Элемент.ТекущиеДанные.Ссылка;
	Объект.Рейс = Элемент.ТекущиеДанные.Рейс;
	Если (Элемент.ТекущиеДанные.ТипДокумента = "Прилет") Тогда 
		Элементы.VIPПассажирыВзрослые.Видимость = Ложь;
		Элементы.VIPПассажирыДети.Видимость = Ложь;		
	Иначе 
		Элементы.VIPПассажирыВзрослые.Видимость = Истина;
		Элементы.VIPПассажирыДети.Видимость = Истина;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПолучитьГраницуЗапретаИзменений() >= Объект.Дата Тогда 
		ЭтаФорма.ТолькоПросмотр = истина;
		Элементы.РедактированиеЗапрещено.Видимость = Истина;
		РедактированиеЗапрещено = "Редактирование данного периода запрещено";
	КонецЕсли;
КонецПроцедуры
