
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	//ищем физ. лицо по имени пользователя 
	ТекПользователь = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя());
	//если не нашли - создадим нового 
	Если ТекПользователь.Пустая() Тогда 
		НовПользователь = Справочники.Пользователи.СоздатьЭлемент(); 
		НовПользователь.Наименование = ИмяПользователя(); 
		НовПользователь.Записать(); 
		ТекПользователь = НовПользователь.Ссылка; 
	КонецЕсли; 
	//присваиваем параметру сеанса ТекущийПользователь ссылку на справочник физ.лиц 
	ПараметрыСеанса.ТекущийПользователь = ТекПользователь; 
КонецПроцедуры
