
&НаСервере
Процедура ПеречитатьНаСервере(ДатаНач, ДатаКон)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеСОП.Ссылка КАК Ссылка,
		|	ДанныеСОП.Документ КАК Документ,
		|	ДанныеСОП.Документ.Рейс КАК ДокументРейс
		|ИЗ
		|	Документ.ДанныеСОП КАК ДанныеСОП
		|ГДЕ
		|	ДанныеСОП.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Док = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Док.Рейс = ВыборкаДетальныеЗаписи.ДокументРейс;
		Док.Записать();
	КонецЦикла; 	
КонецПроцедуры

&НаКлиенте
Процедура Перечитать(Команда)
	ПеречитатьНаСервере(Объект.ДатаНачала,Объект.ДатаОкончания);
КонецПроцедуры
