
Процедура ПриНачалеРаботыСистемы() Экспорт 
	Если Вспомогательные.РольПолныеПраваДиспетчерСОПДиспетчерПДСА() Тогда 
		ОшибкиДанныеСОП = Вспомогательные.ПолучитьОшибкиДанныеСОП();
		Если ОшибкиДанныеСОП.Результат Тогда
			Для Каждого строка из ОшибкиДанныеСОП Цикл 
				Если строка.Ключ = "Результат" Тогда
					Продолжить;	
				КонецЕсли;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Существует расхождение данных диспетчера ПДСА и диспетчера СОП: " + строка.Значение.Разница;
				Сообщение.КлючДанных = строка.Значение.Ссылка;
				Сообщение.Сообщить();	
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры




